{
    "type": "database",
    "name": "local",
    "objects": [
        {
            "type": "table",
            "database": null,
            "name": "alembic_version",
            "withoutRowId": true,
            "ddl": "CREATE TABLE alembic_version (\n\tversion_num VARCHAR(32) NOT NULL, \n\tCONSTRAINT alembic_version_pkc PRIMARY KEY (version_num)\n)",
            "columns": [
                {
                    "name": "version_num",
                    "type": "VARCHAR",
                    "constraints": [
                        {
                            "type": "NOT NULL",
                            "definition": "NOT NULL"
                        }
                    ]
                }
            ],
            "constraints": [
                {
                    "type": "PRIMARY KEY",
                    "definition": "PRIMARY KEY (version_num)\n"
                }
            ],
            "rows": [
                [
                    "1b31e929e1a9"
                ]
            ]
        },
        {
            "type": "table",
            "database": null,
            "name": "article",
            "withoutRowId": true,
            "ddl": "CREATE TABLE article (\n\tid INTEGER NOT NULL, \n\tpubdate DATE NOT NULL, \n\tabstract TEXT, \n\ttitle TEXT, \n\tbody TEXT, \n\tjournal_id INTEGER, \n\tPRIMARY KEY (id), \n\tFOREIGN KEY(journal_id) REFERENCES journal (id)\n)",
            "columns": [
                {
                    "name": "id",
                    "type": "INTEGER",
                    "constraints": [
                        {
                            "type": "NOT NULL",
                            "definition": "NOT NULL"
                        }
                    ]
                },
                {
                    "name": "pubdate",
                    "type": "DATE",
                    "constraints": [
                        {
                            "type": "NOT NULL",
                            "definition": "NOT NULL"
                        }
                    ]
                },
                {
                    "name": "abstract",
                    "type": "TEXT"
                },
                {
                    "name": "title",
                    "type": "TEXT"
                },
                {
                    "name": "body",
                    "type": "TEXT"
                },
                {
                    "name": "journal_id",
                    "type": "INTEGER"
                }
            ],
            "constraints": [
                {
                    "type": "PRIMARY KEY",
                    "definition": "PRIMARY KEY (id)"
                },
                {
                    "type": "FOREIGN KEY",
                    "definition": "FOREIGN KEY(journal_id) REFERENCES journal (id)\n"
                }
            ],
            "rows": [
                [
                    1,
                    "2020-02-28",
                    "Alzheimer's disease (AD) is the most common type of neurodegenerative disease.\nIts typical pathology consists of extracellular amyloid-? (A?) plaques and\nintracellular tau neurofibrillary tangles. Mutations in the APP, PSEN1, and PSEN2\ngenes increase A? production and aggregation, and thus cause early onset or\nfamilial AD. Even with this strong genetic evidence, recent studies support AD to\nresult from complex etiological alterations. Among them, aging is the strongest\nrisk factor for the vast majority of AD cases: Sporadic late onset AD (LOAD).\nAccumulation of DNA damage is a well-established aging factor. In this regard, a \nlarge amount of evidence reveals DNA damage as a critical pathological cause of\nAD. Clinically, DNA damage is accumulated in brains of AD patients. Genetically, \ndefects in DNA damage repair resulted from mutations in the BRAC1 and other DNA\ndamage repair genes occur in AD brain and facilitate the pathogenesis.\nAbnormalities in DNA damage repair can be used as diagnostic biomarkers for AD.\nIn this review, we discuss the association, the causative potential, and the\nbiomarker values of DNA damage in AD pathogenesis.",
                    "Contributions of DNA Damage to Alzheimer's Disease",
                    null,
                    null
                ],
                [
                    2,
                    "2020-02-24",
                    "In an aging society, the number of people suffering from Alzheimer's disease (AD)\nis still growing. Currently, intensive research is being carried out on the\npathogenesis of AD. The results of these studies indicated that oxidative stress \nplays an important role in the onset and development of this disease. Moreover,\nin AD, oxidative stress is generated by both genetic and biochemical factors as\nwell as the functioning of the systems responsible for their formation and\nremoval. The genetic factors associated with the regulation of the redox system\ninclude TOMM40, APOE, LPR, MAPT, APP, PSEN1 and PSEN2 genes. The most important\nbiochemical parameters related to the formation of oxidative species in AD are\np53, homocysteine (Hcy) and a number of others. The formation of reactive oxygen \nspecies (ROS) is also related to the efficiency of the DNA repair system, the\neffectiveness of the apoptosis, autophagy and mitophagy processes as well as the \nantioxidant potential. However, these factors are responsible for the development\nof many disorders, often with similar clinical symptoms, especially in the early \nstages of the disease. The discovery of markers of the early diagnosis of AD may \ncontribute to the introduction of pharmacotherapy and slow down the progression\nof this disease.",
                    "Genetic variants and oxidative stress in Alzheimer's disease",
                    null,
                    null
                ],
                [
                    3,
                    "2020-02-24",
                    "In an aging society, the number of people suffering from Alzheimer's disease (AD)\nis still growing. Currently, intensive research is being carried out on the\npathogenesis of AD. The results of these studies indicated that oxidative stress \nplays an important role in the onset and development of this disease. Moreover,\nin AD, oxidative stress is generated by both genetic and biochemical factors as\nwell as the functioning of the systems responsible for their formation and\nremoval. The genetic factors associated with the regulation of the redox system\ninclude TOMM40, APOE, LPR, MAPT, APP, PSEN1 and PSEN2 genes. The most important\nbiochemical parameters related to the formation of oxidative species in AD are\np53, homocysteine (Hcy) and a number of others. The formation of reactive oxygen \nspecies (ROS) is also related to the efficiency of the DNA repair system, the\neffectiveness of the apoptosis, autophagy and mitophagy processes as well as the \nantioxidant potential. However, these factors are responsible for the development\nof many disorders, often with similar clinical symptoms, especially in the early \nstages of the disease. The discovery of markers of the early diagnosis of AD may \ncontribute to the introduction of pharmacotherapy and slow down the progression\nof this disease.",
                    "Genetic variants and oxidative stress in Alzheimer's disease",
                    null,
                    null
                ],
                [
                    4,
                    "2020-02-04",
                    "Mutations in APP (amyloid precursor protein), PSEN1 (presenilin 1) or PSEN2\n(presenilin 2) are the main cause of early-onset familial forms of Alzheimer's\ndisease (autosomal dominant AD or ADAD). These genes affect ?-secretase-dependent\ngeneration of Amyloid ? (A?) peptides, the main constituent of amyloid plaques\nand one of the pathological hallmarks of AD. Evaluation of patients with ADAD\nincludes assessment of family history, clinical presentation, biomarkers,\nneuropathology when available and DNA sequencing data. These analyses frequently \nuncover novel variants of unknown significance in ADAD genes. This presents a\nbarrier to recruitment of such individuals into clinical trials, unless a\nbiochemical test can demonstrate that a novel mutation results in altered APP\nprocessing in a manner consistent with pathogenicity. Here we describe generation\nand characterization of a novel presenilin 1 and 2 double knock-out in N2A mouse \nneuroblastoma cells using CRISPR\/Cas9, which results in complete ablation of A?\nproduction, decreased Pen-2 expression and Nicastrin glycosylation. Because of\nthe absence of background A? secretion from endogenous ?-secretases, these cells \ncan be used for validation of PSEN1 and PSEN2 variant effects on production of A?\nor other ?-secretase substrates and for biochemical studies of ?-secretase\nfunction using novel variants. We examined several PSEN1 and PSEN2 mutations of\nknown and unknown pathogenicity. Known mutants increased A?42\/A?40 ratio with\nvarying effect on A?40, A?42, total A? levels and Pen-2 expression, which aligns \nwith previous work on these mutants. Our data on novel PSEN1 V142F, G206V and\nG206D mutations suggest that these mutations underlie the reported clinical\nobservations in ADAD patients. We believe our novel cell line will be valuable\nfor the scientific community for reliable validation of presenilin mutations and \nhelpful in defining their pathogenicity to improve and facilitate evaluation of\nADAD patients, particularly in the context of enrollment in clinical trials.",
                    "Novel presenilin 1 and 2 double knock-out cell line for in vitro validation of PSEN1 and PSEN2 mutations.",
                    null,
                    null
                ],
                [
                    5,
                    "2020-01-24",
                    "Alzheimer's disease (AD) is the most common form of dementia. Even though most AD\ncases are sporadic, a small percentage is familial due to autosomal dominant\nmutations in amyloid precursor protein (APP), presenilin-1 (PSEN1), and\npresenilin-2 (PSEN2) genes. AD mutations contribute to the generation of toxic\namyloid ? (A?) peptides and the formation of cerebral plaques, leading to the\nformulation of the amyloid cascade hypothesis for AD pathogenesis. Many drugs\nhave been developed to inhibit this pathway but all these approaches currently\nfailed, raising the need to find additional pathogenic mechanisms. Alterations in\ncellular calcium (Ca2+) signaling have also been reported as causative of\nneurodegeneration. Interestingly, A? peptides, mutated presenilin-1 (PS1), and\npresenilin-2 (PS2) variously lead to modifications in Ca2+ homeostasis. In this\ncontribution, we focus on PS2, summarizing how AD-linked PS2 mutants alter\nmultiple Ca2+ pathways and the functional consequences of this Ca2+ dysregulation\nin AD pathogenesis.",
                    "Intracellular Calcium Dysregulation by the Alzheimer's Disease-Linked Protein Presenilin 2.",
                    null,
                    null
                ],
                [
                    6,
                    "2020-01-24",
                    "BACKGROUND: The molecular changes involved in Alzheimer's disease (AD)\nprogression remain unclear since we cannot easily access antemortem human brains.\nSome non-mammalian vertebrates such as the zebrafish preserve AD-relevant\ntranscript isoforms of the PRESENILIN genes lost from mice and rats. One example \nis PS2V, the alternative transcript isoform of the PSEN2 gene. PS2V is induced by\nhypoxia\/oxidative stress and shows increased expression in late onset, sporadic\nAD brains. A unique, early onset familial AD mutation of PSEN2, K115fs, mimics\nthe PS2V coding sequence suggesting that forced, early expression of PS2V-like\nisoforms may contribute to AD pathogenesis. Here we use zebrafish to model the\nK115fs mutation to investigate the effects of forced PS2V-like expression on the \ntranscriptomes of young adult and aged adult brains.\nMETHODS: We edited the zebrafish genome to model the K115fs mutation. To explore \nits effects at the molecular level, we analysed the brain transcriptome and\nproteome of young (6-month-old) and aged (24-month-old) wild type and\nheterozygous mutant female sibling zebrafish. Finally, we used gene co-expression\nnetwork analysis (WGCNA) to compare molecular changes in the brains of these fish\nto human AD.\nRESULTS: Young heterozygous mutant fish show transcriptional changes suggesting\naccelerated brain aging and increased glucocorticoid signalling. These early\nchanges precede a transcriptional 'inversion' that leads to glucocorticoid\nresistance and other likely pathological changes in aged heterozygous mutant\nfish. Notably, microglia-associated immune responses regulated by the ETS\ntranscription factor family are altered in both our zebrafish mutant model and in\nhuman AD. The molecular changes we observe in aged heterozygous mutant fish occur\nwithout obvious histopathology and possibly in the absence of A?.\nCONCLUSIONS: Our results suggest that forced expression of a PS2V-like isoform\ncontributes to immune and stress responses favouring AD pathogenesis. This\nhighlights the value of our zebrafish genetic model for exploring molecular\nmechanisms involved in AD pathogenesis.",
                    "Accelerated brain aging towards transcriptional inversion in a zebrafish model of the K115fs mutation of human PSEN2.",
                    null,
                    null
                ],
                [
                    7,
                    "2020-01-24",
                    "BACKGROUND: The default mode network (DMN) could be divided into subsystems, the \nfunctional connectivity of which are different across the Alzheimer's disease\n(AD) spectrum. However, the functional connectivity patterns within the\nsubsystems are unknown in presymptomatic autosomal dominant AD (ADAD).\nOBJECTIVE: To investigate functional connectivity patterns within the subsystems \nof the DMN in presymptomatic subjects carrying PSEN1, PSEN2, or APP gene\nmutations.\nMETHODS: Twenty-six presymptomatic mutation carriers (PMC) and twenty-nine\ncognitively normal non-carriers as normal controls (NC) from the same families\nunderwent resting state functional MRI and structural MRI. Seed-based analyses\nwere done to obtain functional connectivity of posterior and anterior DMN. For\nthe regions that showed significant connectivity difference between PMC and NC,\nvolumes were extracted and compared between the two groups. Connectivity measures\nwere then correlated with cognitive tests scores.\nRESULTS: The posterior DMN showed connectivity decrease in the PMC group as\ncompared with the NC group, which was primarily the connectivity of left\nprecuneus with right precuneus and superior frontal gyrus; the anterior DMN\nshowed significant connectivity decrease in the PMC group, which was the\nconnectivity of medial frontal gyrus with middle frontal gyrus. In the brain\nregions showing connectivity changes in the PMC group, there was no group\ndifference in volume. A positive correlation was observed between the precuneus\nconnectivity value and Mini-Mental State Examination total score.\nCONCLUSION: Functional connectivity within both posterior and anterior DMN were\ndisrupted in the presymptomatic stage of ADAD. Connectivity disruption within the\nposterior DMN may be useful for early identification of general cognitive decline\nand a potential imaging biomarker for early diagnosis.",
                    "Functional Connectivity of Default Mode Network Subsystems in the Presymptomatic Stage of Autosomal Dominant Alzheimer's Disease.",
                    null,
                    null
                ],
                [
                    8,
                    "2020-01-01",
                    "INTRODUCTION: The PSENs\/APP mutation distribution in Chinese patients with\nfamilial Alzheimer's disease (FAD) remains unclear. We aimed to analyze the\ngenetic features of Chinese FAD pedigrees with and without PSENs\/APP mutations.\nMETHODS: In total, 1330 patients with Alzheimer's disease (AD) or mild cognitive \nimpairment in 404 pedigrees were enrolled from the Chinese Familial Alzheimer's\nDisease Network. PSENs\/APP mutations and APOE frequencies were determined.\nRESULTS: In total, 13.12% of pedigrees carried PSENs\/APP missense mutations,\n3.71% carried PSENs\/APP synonymous\/untranslated region variants, and 83.17% did\nnot carry PSENs\/APP mutations. Eleven missense mutations were first identified.\nIn patients without PSENs\/APP mutations, 44.31% carried one APOE?4 allele, and\n14.85% two APOE?4 alleles.\nDISCUSSION: The new PSENs\/APP mutations indicate heterogeneity in AD pathogenesis\nbetween Chinese and other ethnic groups. The low mutation rate suggests the\ninvolvement of other genes\/factors in Chinese FAD. APOE?4 might be a major gene\nfor some FAD without PSENs\/APP mutations.",
                    "PSEN1, PSEN2, and APP mutations in 404 Chinese pedigrees with familial Alzheimer's disease.",
                    null,
                    null
                ],
                [
                    9,
                    "2019-12-24",
                    "To fight Alzheimer's disease (AD), we should know when, where, and how brain\nnetwork dysfunctions initiate. In AD mouse models, relevant information can be\nderived from brain electrical activity. With a multi-site linear probe, we\nrecorded local field potentials simultaneously at the posterior-parietal cortex\nand hippocampus of wild-type and double transgenic AD mice, under anesthesia. We \nfocused on PS2APP (B6.152H) mice carrying both presenilin-2 (PS2) and amyloid\nprecursor protein (APP) mutations, at three and six months of age, before and\nafter plaque deposition respectively. To highlight defects linked to either the\nPS2 or APP mutation, we included in the analysis age-matched PS2.30H and\nAPP-Swedish mice, carrying each of the mutations individually. Our study also\nincluded PSEN2-\/- mice. At three months, only predeposition B6.152H mice show a\nreduction in the functional connectivity of slow oscillations (SO) and in the\npower ratio between SO and delta waves. At six months, plaque-seeding B6.152H\nmice undergo a worsening of the low\/high frequency power imbalance and show a\nmassive loss of cortico-hippocampal phase-amplitude coupling (PAC) between SO and\nhigher frequencies, a feature shared with amyloid-free PS2.30H mice. We conclude \nthat the PS2 mutation is sufficient to impair SO PAC and accelerate network\ndysfunctions in amyloid-accumulating mice.",
                    "Dampened Slow Oscillation Connectivity Anticipates Amyloid Deposition in the PS2APP Mouse Model of Alzheimer's Disease.",
                    null,
                    null
                ],
                [
                    10,
                    "2020-03-01",
                    "Patients with Alzheimer's disease (AD) experience seizures at higher rates than\nthe general population of that age, suggesting an underexplored role of\nhyperexcitability in AD. Genetic variants in presenilin (PSEN) 1 and 2 genes lead\nto autosomal dominant early-onset AD (ADAD); patients with PSEN gene variants\nalso report seizures. Pharmacological control of seizures in AD may be\ndisease-modifying. Preclinical efficacy of FDA-approved antiseizure drugs (ASDs) \nis well defined in young adult rodents; however, the efficacy of ASDs in aged\nrodents with chronic seizures is less clear. The mechanism by which ADAD genes\nlead to AD remains unclear, and even less studied is the pathogenesis of epilepsy\nin AD. PSEN variants generally all result in a biochemical loss of function (De\nStrooper, 2007). We herein determined whether well-established models of acute\nand chronic seizure could be used to explore the relationship between AD genes\nand seizures through investigating whether loss of normal PSEN2 function\nage-dependently influenced susceptibility to seizures and\/or corneal kindling\nacquisition. PSEN2 knockout (KO) and age-matched wild-type (WT) mice were\nscreened from 2- to 10-months-old to establish age-dependent focal seizure\nthreshold. Additionally, PSEN2 KO and WT mice aged 2- and 8-months-old underwent \ncorneal kindling such that mice were aged 3- and 9-months old at the beginning of\nASD efficacy testing. We then defined the dose-dependent efficacy of\nmechanistically distinct ASDs on kindled seizures of young versus aged mice to\nbetter understand the applicability of corneal kindling to real-world use for\ngeriatric patients. PSEN2 KO mice demonstrated early-life reductions in seizure\nthreshold. However, kindling acquisition was delayed in 2-month-old PSEN2 KO\nversus WT mice. Young male WT mice took 24.3ʱ�1.3 (S.E.M.) stimulations to\nachieve kindling criterion, whereas age-matched PSEN2 KO male mice took\n41.2ʱ�1.1 stimulations (p�<�.0001). The rate of kindling acquisition of\n8-month-old mice was no longer different from WT. This study demonstrates that\nloss of normal PSEN2 function is associated with age-dependent changes in the in \nvivo susceptibility to acute seizures and kindling. Loss of normal PSEN2 function\nmay be an underexplored molecular contributor to seizures. The use of validated\nmodels of chronic seizures in aged rodents may uncover age-related changes in\nsusceptibility to epileptogenesis and\/or ASD efficacy in mice with AD-associated \ngenotypes, which may benefit the management of seizures in AD.",
                    "Loss of presenilin 2 age-dependently alters susceptibility to acute seizures and  kindling acquisition.",
                    null,
                    null
                ]
            ]
        },
        {
            "type": "table",
            "database": null,
            "name": "author",
            "withoutRowId": true,
            "ddl": "CREATE TABLE author (\n\tid INTEGER NOT NULL, \n\tname VARCHAR(64) NOT NULL, \n\tPRIMARY KEY (id)\n)",
            "columns": [
                {
                    "name": "id",
                    "type": "INTEGER",
                    "constraints": [
                        {
                            "type": "NOT NULL",
                            "definition": "NOT NULL"
                        }
                    ]
                },
                {
                    "name": "name",
                    "type": "VARCHAR",
                    "constraints": [
                        {
                            "type": "NOT NULL",
                            "definition": "NOT NULL"
                        }
                    ]
                }
            ],
            "constraints": [
                {
                    "type": "PRIMARY KEY",
                    "definition": "PRIMARY KEY (id)\n"
                }
            ],
            "rows": [
            ]
        },
        {
            "type": "table",
            "database": null,
            "name": "author_association",
            "withoutRowId": true,
            "ddl": "CREATE TABLE author_association (\n\tauthor_id INTEGER, \n\tarticle_id INTEGER, \n\tFOREIGN KEY(article_id) REFERENCES article (id), \n\tFOREIGN KEY(author_id) REFERENCES author (id)\n)",
            "columns": [
                {
                    "name": "author_id",
                    "type": "INTEGER"
                },
                {
                    "name": "article_id",
                    "type": "INTEGER"
                }
            ],
            "constraints": [
                {
                    "type": "FOREIGN KEY",
                    "definition": "FOREIGN KEY(article_id) REFERENCES article (id)"
                },
                {
                    "type": "FOREIGN KEY",
                    "definition": "FOREIGN KEY(author_id) REFERENCES author (id)\n"
                }
            ],
            "rows": [
            ]
        },
        {
            "type": "table",
            "database": null,
            "name": "journal",
            "withoutRowId": true,
            "ddl": "CREATE TABLE journal (\n\tid INTEGER NOT NULL, \n\tname VARCHAR(256), \n\tPRIMARY KEY (id)\n)",
            "columns": [
                {
                    "name": "id",
                    "type": "INTEGER",
                    "constraints": [
                        {
                            "type": "NOT NULL",
                            "definition": "NOT NULL"
                        }
                    ]
                },
                {
                    "name": "name",
                    "type": "VARCHAR"
                }
            ],
            "constraints": [
                {
                    "type": "PRIMARY KEY",
                    "definition": "PRIMARY KEY (id)\n"
                }
            ],
            "rows": [
            ]
        },
        {
            "type": "table",
            "database": null,
            "name": "journaldata",
            "withoutRowId": true,
            "ddl": "CREATE TABLE journaldata (\n\tid INTEGER NOT NULL, \n\tpages VARCHAR(32), \n\tjournal_id INTEGER, \n\tarticle_id INTEGER, \n\tPRIMARY KEY (id), \n\tFOREIGN KEY(article_id) REFERENCES article (id), \n\tFOREIGN KEY(journal_id) REFERENCES journal (id)\n)",
            "columns": [
                {
                    "name": "id",
                    "type": "INTEGER",
                    "constraints": [
                        {
                            "type": "NOT NULL",
                            "definition": "NOT NULL"
                        }
                    ]
                },
                {
                    "name": "pages",
                    "type": "VARCHAR"
                },
                {
                    "name": "journal_id",
                    "type": "INTEGER"
                },
                {
                    "name": "article_id",
                    "type": "INTEGER"
                }
            ],
            "constraints": [
                {
                    "type": "PRIMARY KEY",
                    "definition": "PRIMARY KEY (id)"
                },
                {
                    "type": "FOREIGN KEY",
                    "definition": "FOREIGN KEY(article_id) REFERENCES article (id)"
                },
                {
                    "type": "FOREIGN KEY",
                    "definition": "FOREIGN KEY(journal_id) REFERENCES journal (id)\n"
                }
            ],
            "rows": [
            ]
        },
        {
            "type": "table",
            "database": null,
            "name": "tag",
            "withoutRowId": true,
            "ddl": "CREATE TABLE tag (\n\tid INTEGER NOT NULL, \n\tname VARCHAR(32), \n\tPRIMARY KEY (id), \n\tUNIQUE (name)\n)",
            "columns": [
                {
                    "name": "id",
                    "type": "INTEGER",
                    "constraints": [
                        {
                            "type": "NOT NULL",
                            "definition": "NOT NULL"
                        }
                    ]
                },
                {
                    "name": "name",
                    "type": "VARCHAR"
                }
            ],
            "constraints": [
                {
                    "type": "PRIMARY KEY",
                    "definition": "PRIMARY KEY (id)"
                },
                {
                    "type": "UNIQUE",
                    "definition": "UNIQUE (name)\n"
                }
            ],
            "rows": [
            ]
        },
        {
            "type": "table",
            "database": null,
            "name": "tag_association",
            "withoutRowId": true,
            "ddl": "CREATE TABLE tag_association (\n\ttag_id INTEGER, \n\tarticle_id INTEGER, \n\tFOREIGN KEY(article_id) REFERENCES article (id), \n\tFOREIGN KEY(tag_id) REFERENCES tag (id)\n)",
            "columns": [
                {
                    "name": "tag_id",
                    "type": "INTEGER"
                },
                {
                    "name": "article_id",
                    "type": "INTEGER"
                }
            ],
            "constraints": [
                {
                    "type": "FOREIGN KEY",
                    "definition": "FOREIGN KEY(article_id) REFERENCES article (id)"
                },
                {
                    "type": "FOREIGN KEY",
                    "definition": "FOREIGN KEY(tag_id) REFERENCES tag (id)\n"
                }
            ],
            "rows": [
            ]
        }
    ]
}